# Lab05 Python Data Science with Pandas

## Please submit your finished lab05 jupyter notebook via pull request in GitHub

In [127]:
# magic command to display matplotlib plots inline within the ipython notebook webpage
%matplotlib inline

# import necessary modules
import pandas as pd, numpy as np, matplotlib.pyplot as plt

## Part 1 <br /> Basics of Selecting and Slicing Data

In [128]:
# create a pandas dataframe from the location data set
df = pd.read_csv('data/summer-travel-gps-full.csv')
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [129]:
# Q1: how to get 2 columns from the dataframe (city and country)?
df[['city','country']]

              city         country
0     West Drayton  United Kingdom
1         Hounslow  United Kingdom
2         Hounslow  United Kingdom
3         Hounslow  United Kingdom
4         Hounslow  United Kingdom
...            ...             ...
1754        Munich         Germany
1755        Munich         Germany
1756        Munich         Germany
1757        Munich         Germany
1758        Munich         Germany

[1759 rows x 2 columns]

To get a single "cell's" value out of a dataframe, pass a column name, then a row label. This is equivalent to slicing the dataframe down to a single series, then slicing a single value out of that series using [ ] indexing.

In [130]:
# Q2: how to get the first 5 rows of the "city" column?
df['city'][:5]

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
4        Hounslow
Name: city, dtype: object

### Using .loc[ ]

In [131]:
# Q3: how to use .loc to select the third row of the dataframe?
df.loc[[2]]

         lat       lon              date      city         country
2  51.478199 -0.446081  05/14/2014 10:51  Hounslow  United Kingdom

In [132]:
# Q4: how to use .loc to select the first row in "country" column?
df.loc[:0,['country']]

          country
0  United Kingdom

In [133]:
# Q5: how to select the first 4 rows of ['city', 'date'] columns?
df.loc[:3,['city','date']]

           city              date
0  West Drayton  05/14/2014 09:07
1      Hounslow  05/14/2014 09:22
2      Hounslow  05/14/2014 10:51
3      Hounslow  05/14/2014 11:24

### Using .iloc[ ]

In [134]:
# use .iloc for integer position based indexing
# Q6: how to get the value from the row in position 3 and the column in position 2
df.iloc[3,2]

'05/14/2014 11:24'

In [135]:
# Q7: how to use iloc to select every 300th row from a data set
df.iloc[[300][:]]

           lat       lon              date       city country
300  41.377091  2.151175  05/20/2014 03:18  Barcelona   Spain

## Part 2 <br /> How to select rows by some value(s)

In [136]:
# load a reduced set of gps data
df = pd.read_csv('data/summer-travel-gps-simplified.csv')
df.tail()

           lat        lon              date      city  country
173  41.044556  28.983286  07/08/2014 16:44  Istanbul   Turkey
174  41.008992  28.968268  07/08/2014 20:03  Istanbul   Turkey
175  41.043487  28.985488  07/08/2014 22:18  Istanbul   Turkey
176  40.977637  28.823879  07/09/2014 09:03  Istanbul   Turkey
177  48.357110  11.791346  07/09/2014 13:20    Munich  Germany

In [137]:
# Q9: create a Series of true/false, indicating if each "city" row in the column is equal to "Munich"
df['True/False']=df['city']=="Munich"
df

,lat,lon,date,city,country,True/False
0,51.481292,-0.451011,05/14/2014 09:07,West Drayton,United Kingdom,False
1,38.781775,-9.137544,05/14/2014 15:11,Lisbon,Portugal,False
2,38.711050,-9.139739,05/14/2014 16:40,Lisbon,Portugal,False
3,38.715637,-9.120558,05/14/2014 18:25,Lisbon,Portugal,False
4,38.711977,-9.141788,05/14/2014 19:26,Lisbon,Portugal,False
...,...,...,...,...,...,...
173,41.044556,28.983286,07/08/2014 16:44,Istanbul,Turkey,False
174,41.008992,28.968268,07/08/2014 20:03,Istanbul,Turkey,False
175,41.043487,28.985488,07/08/2014 22:18,Istanbul,Turkey,False
176,40.977637,28.823879,07/09/2014 09:03,Istanbul,Turkey,False
177,48.357110,11.791346,07/09/2014 13:20,Munich,Germany,True

In [138]:
# pandas logical operators are: | for or, & for and, ~ for not
# these must be grouped by using parentheses
# Q10: what cities were visited in spain that were not barcelona? Create a dataframe for it.
visited_cities=df.loc[(df['country']=='Spain')&(df['city']!='Barcelona')]
visited_cities

,lat,lon,date,city,country,True/False
24,41.303911,2.105931,05/18/2014 22:35,El Prat de Llobregat,Spain,False
25,41.289946,2.064590,05/18/2014 23:04,Viladecans,Spain,False
126,41.306752,2.097624,06/12/2014 17:19,El Prat de Llobregat,Spain,False
127,41.304333,2.072728,06/12/2014 17:49,El Prat de Llobregat,Spain,False
131,41.358460,2.128701,06/13/2014 11:35,Hospitalet de Llobregat,Spain,False
138,41.294761,2.059722,06/20/2014 22:15,Viladecans,Spain,False

In [139]:
# Q11: select rows where either the city is munich, or the country is serbia
munich_serbia=df.loc[(df['city']=='Munich')|(df['country']=='Serbia')]
munich_serbia

           lat        lon              date       city  country  True/False
139  44.821164  20.289821  06/21/2014 01:59   Belgrade   Serbia       False
140  44.820414  20.463465  06/21/2014 18:44   Belgrade   Serbia       False
141  44.761583  19.577904  06/22/2014 07:58  Slepčević   Serbia       False
177  48.357110  11.791346  07/09/2014 13:20     Munich  Germany        True

In [140]:
# Q12: how many observations are west of the prime meridian?
len(df[df['lon']<0])

24

In [141]:
# Q13: get all rows that contain a city that starts with the letter G
df[df['city'].str[0]=='G']

           lat        lon              date         city  country  True/False
62   50.273632  18.729429  06/02/2014 06:39      Gliwice   Poland       False
114  48.282940   8.199630  06/10/2014 13:33       Gutach  Germany       False
115  48.389029   8.021342  06/10/2014 13:48   Gengenbach  Germany       False
152  40.187825  20.079303  07/04/2014 17:42  Gjirokastër  Albania       False

In [142]:
# Q14: how many unique cities and countries in the dataset? 
df.country.unique()
print("there are", len(df.country.unique()), "unique countries")

df.city.unique()
print("there are", len(df.city.unique()), "unique cities")

# Also can you check missing values for the dataframe
df[:].isnull().sum()

there are 15 unique countries
there are 91 unique cities

lat           0
lon           0
date          0
city          0
country       0
True/False    0
dtype: int64

In [143]:
# Q15: group by country name and show the city names in each of the country
country=df.drop_duplicates('city')
country_group=country.groupby("country", as_index=False)['city'].sum()
country_group

                   country                                               city
0                  Albania                                   BeratGjirokastër
1   Bosnia and Herzegovina                                     SarajevoMostar
2                  Croatia                                PločeSplitDubrovnik
3           Czech Republic  Novy BohuminHranicePrerovÚstí nad OrlicíKojice...
4                  Germany  KümmersbruckWinkelhaidKammersteinEllhofenObers...
5                   Greece        KakaviaDytiki ElladaPeloponneseAthensAttica
6                   Kosovo                                            Prizren
7        Macedonia (FYROM)                                              Ohrid
8               Montenegro                                              Kotor
9                   Poland  ZendekSilesian VoivodeshipDabrowa GorniczaOlku...
10                Portugal  LisbonAlgueirão-Mem MartinsSintraAzambujaSanta...
11                  Serbia                                  BelgradeSlepčević
12                   Spain  El Prat de LlobregatViladecansBarcelonaHospita...
13                  Turkey                                           Istanbul
14          United Kingdom                                       West Drayton

## Part 3 <br /> How to select based on a date-time values

In [144]:
# load the location data set, indexed by the date field
# and, parse the dates so they're no longer strings but now rather Python datetime objects
# this lets us do date and time based operations on the data set
dt = pd.read_csv('data/summer-travel-gps-full.csv', index_col='date', parse_dates=True)
dt.head()

                           lat       lon          city         country
date
2014-05-14 09:07:00  51.481292 -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005 -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146 -0.451562      Hounslow  United Kingdom

In [145]:
# Q16: is the timestamp index unique? How can you use code to find it? 
dt.index.is_unique

False

In [146]:
# Q17: drop duplicate index 
dt.loc[~dt.index.duplicated(),:]

                           lat        lon          city         country
date
2014-05-14 09:07:00  51.481292  -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005  -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199  -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199  -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146  -0.451562      Hounslow  United Kingdom
...                        ...        ...           ...             ...
2014-07-09 13:13:00  48.356013  11.791710        Munich         Germany
2014-07-09 13:14:00  48.356529  11.792183        Munich         Germany
2014-07-09 13:17:00  48.356285  11.791710        Munich         Germany
2014-07-09 13:18:00  48.355328  11.791710        Munich         Germany
2014-07-09 13:20:00  48.357110  11.791346        Munich         Germany

[1758 rows x 4 columns]

In [159]:
# Q18: create a weekday and a weekend dataframe
dt['dayofweek']=dt.index.day_name()
dt

,lat,lon,city,country,dayofweek
date,,,,,
2014-05-14 09:07:00,51.481292,-0.451011,West Drayton,United Kingdom,Wednesday
2014-05-14 09:22:00,51.474005,-0.450999,Hounslow,United Kingdom,Wednesday
2014-05-14 10:51:00,51.478199,-0.446081,Hounslow,United Kingdom,Wednesday
2014-05-14 11:24:00,51.478199,-0.446081,Hounslow,United Kingdom,Wednesday
2014-05-14 11:38:00,51.474146,-0.451562,Hounslow,United Kingdom,Wednesday
...,...,...,...,...,...
2014-07-09 13:13:00,48.356013,11.791710,Munich,Germany,Wednesday
2014-07-09 13:14:00,48.356529,11.792183,Munich,Germany,Wednesday
2014-07-09 13:17:00,48.356285,11.791710,Munich,Germany,Wednesday
2014-07-09 13:18:00,48.355328,11.791710,Munich,Germany,Wednesday
2014-07-09 13:20:00,48.357110,11.791346,Munich,Germany,Wednesday

In [148]:
# Q19: calculate and plot the number of observations each day of the week has